In [20]:
import pandas as pd

title_df = pd.read_csv('data/title.basics.tsv.gz', sep='\t', dtype=str, na_values=["\\N"])

principals_df = pd.read_csv('data/title.principals.tsv.gz', sep='\t', dtype=str, na_values=["\\N"])

names_df = pd.read_csv("data/name.basics.tsv.gz", sep="\t", dtype=str, na_values=["\\N"])

In [21]:
principals_df = principals_df.loc[(principals_df['category'] == 'actor') | (principals_df['category'] == 'actress')]

In [22]:
title_df = title_df.loc[title_df['titleType'] == 'movie']
title_df.drop(columns=['titleType','originalTitle', 'isAdult', 'endYear'], inplace=True)

In [23]:
principals_df.drop(columns=['ordering', 'category', 'job', 'characters'], inplace=True)
names_df.drop(columns=['birthYear', 'deathYear', 'primaryProfession', 'knownForTitles'], inplace=True)

In [24]:
data = pd.merge(principals_df, names_df, on='nconst', how='left')

In [25]:
data.head()

      tconst     nconst       primaryName
0  tt0000005  nm0443482    Charles Kayser
1  tt0000005  nm0653042          John Ott
2  tt0000007  nm0179163  James J. Corbett
3  tt0000007  nm0183947    Peter Courtney
4  tt0000008  nm0653028          Fred Ott

In [26]:
data_df = pd.merge(data, title_df, on='tconst', how='right')

In [27]:
data_df.head()

,tconst,nconst,primaryName,primaryTitle,startYear,runtimeMinutes,genres
0,tt0000009,nm0063086,Blanche Bayliss,Miss Jerry,1894,45,Romance
1,tt0000009,nm0183823,William Courtenay,Miss Jerry,1894,45,Romance
2,tt0000009,nm1309758,Chauncey Depew,Miss Jerry,1894,45,Romance
3,tt0000147,NaN,NaN,The Corbett-Fitzsimmons Fight,1897,100,"Documentary,News,Sport"
4,tt0000502,nm0215752,Antonio del Pozo,Bohemios,1905,100,NaN

In [29]:
data_df['primaryName'] = data_df['primaryName'].fillna('Unknown')

In [ ]:
data_df_grouped = data_df.groupby(['tconst'])['primaryName'].agg({', '.join, 'primaryTitle' : 'first', 'startYear' : 'first', 'runtimeMinutes' : 'first', 'genres' : 'first'}).reset_index()

In [31]:
data_df_grouped.head()

      tconst                                        primaryName
0  tt0000009  Blanche Bayliss, William Courtenay, Chauncey D...
1  tt0000147                                            Unknown
2  tt0000502                      Antonio del Pozo, El Mochuelo
3  tt0000574  Elizabeth Tait, John Tait, Nicholas Brierley, ...
4  tt0000591  Georges Wague, Henri Gouget, Christiane Mandel...

In [32]:
data_df_grouped.to_csv("data/crew.csv", index=False, sep=";")

In [ ]:
principals_df.loc[principals_df['category'] == 'actor']

principals_df.drop(columns=['ordering', 'category', 'job', 'characters'], inplace=True)